Had another look here and there's a few issues going on.

Firstly the diff displayed in the original issue is plain wrong. The properties shown to change from the same value are not actually present in the state, so can't have that value.

This bit is fixed by enrolling the resource into a bridge feature called PlanResourceChange: https://github.com/pulumi/pulumi-azure/pull/2150

Unfortunately that does not fix the replace but the diff is actually sensible but still not 100% obvious. The resource is replaced due to `dnsEndpointType`

```
    +-azure:storage/account:Account: (replace)
        [id=/subscriptions/0282681f-7a9e-424b-80b2-96babd57a8a1/resourceGroups/resourcegroup80080f67/providers/Microsoft.Storage/storageAccounts/ducktest266df7d]
        [urn=urn:pulumi:dev::azure_2134_repro::azure:storage/account:Account::ducktest]
        [provider: urn:pulumi:dev::azure_2134_repro::pulumi:providers:azure::default_4_42_0::6702e220-3f67-4489-9507-824a449a2227 => urn:pulumi:dev::azure_2134_repro::pulumi:providers:azure::default_5_81_0::output<string>]
      + allowNestedItemsToBePublic   : true
      + crossTenantReplicationEnabled: true
      + defaultToOauthAuthentication : false
      + dnsEndpointType              : "Standard"
      + localUserEnabled             : true
      + publicNetworkAccessEnabled   : true
      + sftpEnabled                  : false
```

which is visible from the GRPC call:

```json
"detailedDiff": {
            "allowNestedItemsToBePublic": {},
            "crossTenantReplicationEnabled": {},
            "defaultToOauthAuthentication": {},
            "dnsEndpointType": {
                "kind": "ADD_REPLACE"
            },
            "localUserEnabled": {},
            "publicNetworkAccessEnabled": {},
            "sftpEnabled": {}
        },
```

The CLI output here can be improved but that looks like something on the engine side perhaps?

However this now reproes in Terraform too:
```hcl
provider "azurerm" {
  features {}
  version = "2.99.0" // change to 3.109.0
}

resource "azurerm_resource_group" "resourceGroup" {
  name     = "resourceGroup"
  location = "westeurope"
}

resource "azurerm_storage_account" "ducktest12" {
  name                     = "ducktest12"
  resource_group_name      = azurerm_resource_group.resourceGroup.name
  location                 = "westeurope"
  account_tier             = "Standard"
  account_kind             = "StorageV2"
  account_replication_type = "LRS"
  access_tier              = "Hot"
  enable_https_traffic_only  = true

  min_tls_version           = "TLS1_2"

  network_rules {
    default_action = "Deny"
    virtual_network_subnet_ids = []
    ip_rules = []
  }
}
```

yields the same replace after upgrading `terraform plan -refresh=false`:

```
  # azurerm_storage_account.ducktest12 must be replaced
-/+ resource "azurerm_storage_account" "ducktest12" {
      ~ allow_nested_items_to_be_public    = false -> true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard" # forces replacement
      ~ id                                 = "/subscriptions/0282681f-7a9e-424b-80b2-96babd57a8a1/resourceGroups/resourceGroup/providers/Microsoft.Storage/storageAccounts/ducktest12" -> (known after apply)
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
        name                               = "ducktest12"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://ducktest12.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "ducktest12.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://ducktest12.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "ducktest12.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://ducktest12.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "ducktest12.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "westeurope" -> (known after apply)
      ~ primary_queue_endpoint             = "https://ducktest12.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "ducktest12.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://ducktest12.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "ducktest12.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://ducktest12.z6.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "ducktest12.z6.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
        # (15 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled      = false -> null
          - last_access_time_enabled = false -> null
          - versioning_enabled       = false -> null
            # (1 unchanged attribute hidden)
        }

      ~ network_rules {
          ~ bypass                     = [
              - "AzureServices",
            ] -> (known after apply)
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }
```

However, running with refresh `terraform plan` does not yield a replace:

```
  # azurerm_storage_account.ducktest12 will be updated in-place
  ~ resource "azurerm_storage_account" "ducktest12" {
      ~ allow_nested_items_to_be_public   = false -> true
      ~ cross_tenant_replication_enabled  = false -> true
        id                                = "/subscriptions/0282681f-7a9e-424b-80b2-96babd57a8a1/resourceGroups/resourceGroup/providers/Microsoft.Storage/storageAccounts/ducktest12"
        name                              = "ducktest12"
        tags                              = {}
        # (61 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }
```

Unfortunately the refresh does not fix the issue on the pulumi side.